In [3]:
import pandas as pd

In [4]:
df= pd.read_csv("globalAirQuality.csv")
df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [5]:
# selecting collum data
df[["country", "city", "pm25"]]

      country      city    pm25
0          US  New York  50.295
1          US  New York  32.083
2          US  New York  42.250
3          US  New York  30.403
4          US  New York  21.083
...       ...       ...     ...
17995      CH    Zurich  27.899
17996      CH    Zurich   2.950
17997      CH    Zurich  61.347
17998      CH    Zurich  40.722
17999      CH    Zurich  25.830

[18000 rows x 3 columns]

In [6]:
# selecting row data
# 1. loc --> label based accesing data
# 2. iloc --> index based accesing data
df.loc[0:3] # start idx : end idx (inclusive)
df.iloc[0:2] # start idx : end idx (exclusive)

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969

In [7]:
# selecting individual cells
df.loc[0:2, ["country", "city", "pm25"]]
df.iloc[0:3, [1,2,5]]

  country      city    pm25
0      US  New York  50.295
1      US  New York  32.083
2      US  New York  42.250

In [8]:
# select single scalar value
df.at[0, "city"]
df.iat[0, 3]

np.float64(40.713)

In [9]:
# view and copy data
cities = df["city"].copy()
cities[0] = "Dhaka"

In [10]:
# filtering data
# finding cities which aqi is greater then 100
aqi_temp = df[(df["aqi"] > 100) & (df["temperature"] > 35)][["city", "country"]]
aqi_temp.iloc[0]
# aqi_temp.loc[6]

city       New York
country          US
Name: 6, dtype: object

In [11]:
# query --> return a copy
df.query("aqi > 150 & temperature > 30")[["country", "city", "pm25"]]

      country      city    pm25
6          US  New York  77.690
44         US  New York  78.186
112        US  New York  96.012
284        US  New York  45.166
329        US  New York  83.572
...       ...       ...     ...
17589      FI  Helsinki  37.575
17665      CH    Zurich  83.983
17797      CH    Zurich  35.086
17821      CH    Zurich  83.401
17822      CH    Zurich  20.396

[185 rows x 3 columns]

In [12]:
# data cleaning
# -> handle missing values
rd = pd.read_csv("raw_data.csv")
rd.isnull()
rd.isna().sum()
rd.dropna(axis=1)
# rd.fillna(0)
# rdf = rd.ffill()
# rdb = rd.bfill()
cleaned_data = rd.copy()
cleaned_data["age"] = cleaned_data["age"].fillna(cleaned_data["age"].mean())
# cleaned_data

In [13]:
# --> handle duplicate values
# 1. dtypes
# 2. astypes(new type)
# 3. to_datetime()

rd["country"].duplicated()
rd.drop_duplicates()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [14]:
rd_2 = rd.copy()
rd_2 = rd_2.fillna(0)
rd_2["age"] = rd_2["age"].astype("int64")
rd_2.dtypes

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [15]:
# df_tiem = df["timestamp"].to_datetime(df["timestamp"])

In [20]:
# string handling
rd["name"].str.split(" ")

0         [John, Doe]
1         [John, Doe]
2       [Jane, Smith]
3              [Alex]
4     [Maria, Garcia]
5           [Li, Wei]
6                 NaN
7       [Ahmed, Khan]
8       [Rachel, Lee]
9      [Carlos, Ruiz]
10     [Emily, Davis]
Name: name, dtype: object